ksd_file/request1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Body><transferKSDPositions xmlns="http://www.bmw.com/SRP" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" refSchema="serviceRepairPackages.xsd" version="01.00.05"><vin vinLongPrefix="WBA5E52070" vinShort="GJ37054"/><position><flatRate productType="car"><number>1700509</number><designation>Check the cooling system for watertightness, with the special tool</designation><value>2</value></flatRate></position><position><flatRate productType="car"><number>1700010</number><designation>Checking the tightness between the cooling system , combustion chamber</designation><value>4</value></flatRate></position><position><flatRate productType="car"><number>1711500</number><designation>Removing , installing coolant, radiator</designation><additionalInformation>(coolant drained)</additionalInformation><value>9</value></flatRate></position><position><flatRate productType="car"><number>1711046</number><designation>Removing , installing/replacing module bracket</designation><value>30</value></flatRate></position></transferKSDPositions></SOAP-ENV:Body></SOAP-ENV:Envelope>